# parameters
nc: 2  # number of classes
depth_multiple: 1.0  # expand model depth
width_multiple: 1.0  # expand layer channels

# anchors
anchors:
  - [ 19,27,  44,40,  38,94 ]  # P3/8
  - [ 96,68,  86,152,  180,137 ]  # P4/16
  - [ 140,301,  303,264,  238,542 ]  # P5/32
  - [ 436,615,  739,380,  925,792 ]  # P6/64

# cspdarknet53 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, NoThing, [3]],  # 0
   [-1, 1, efficientnetBlock, [8]],
   [-1, 1, efficientnetBlock, [16, 0]],  # P1/2
   [-2, 1, efficientnetBlock, [24, 1]],  # P2/4
   [-3, 1, efficientnetBlock, [48, 2]], # P3/8
   [-4, 1, efficientnetBlock, [120, 3]], # P4/16
   [-5, 1, efficientnetBlock, [352, 4]], # P5/32
   [-1, 1, Involution , [352, 3, 2]], # P6/64
   [-1, 3, BottleneckCSPF, [320]],  # 8
  ]

# yolov4l head
# na = len(anchors[0])
head:
  [[-1, 1, SPPCSP, [320]], # 9
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-6, 1, Conv, [256, 1, 1]], # route backbone P5
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, BottleneckCSP2, [256]], # 14
   [-1, 1, Conv, [192, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-12, 1, Conv, [192, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, BottleneckCSP2, [192]], # 19
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-18, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, BottleneckCSP2, [128]], # 24
   [-1, 1, Conv, [256, 3, 1]],    # head 1
   [-2, 1, Conv, [192, 3, 2]],
   [[-1, 19], 1, Concat, [1]],  # cat
   [-1, 3, BottleneckCSP2, [192]], # 28
   [-1, 1, Conv, [384, 3, 1]],    # head 2
   [-2, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat
   [-1, 3, BottleneckCSP2, [256]], # 32
   [-1, 1, Conv, [512, 3, 1]],    # head 3
   [-2, 1, Conv, [320, 3, 2]],
   [[-1, 9], 1, Concat, [1]],  # cat
   [-1, 3, BottleneckCSP2, [320]], # 36
   [-1, 1, Conv, [640, 3, 1]],    # head 4

   [[25,29,33,37], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5, P6)
  ]